
===========================================================================
report_tns
============================================================================
tns -122.76

===========================================================================
report_wns
============================================================================
wns -4.65

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -4.65

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.19
