
===========================================================================
report_tns
============================================================================
tns -0.48

===========================================================================
report_wns
============================================================================
wns -0.17

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.17

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.21
