
===========================================================================
report_tns
============================================================================
tns -117.50

===========================================================================
report_wns
============================================================================
wns -4.44

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -4.44

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.18
