
===========================================================================
report_tns
============================================================================
tns -128.53

===========================================================================
report_wns
============================================================================
wns -4.86

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -4.86

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.20
